## このページについて
pandasのgroupby後にfirst/last/head/tail/nth関数。  
完成したブログ記事  
まだない。

In [1]:
import pandas as pd

pd.options.display.notebook_repr_html = False # DataFrameの表を綺麗にHTMLで表示されるとブログに貼り付けづらい。テキストにする

In [24]:
df = pd.DataFrame({
    'name'    : ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Fred', 'George', 'Helen', 'Ian', 'John'],
    'class'   : ['A', 'A', 'B', 'B', 'A', 'C', 'A', 'B', 'C', 'C'],
    'English' : list(range(0, 100, 10)),
    'Math'    : list(range(100, 0, -10))    
})

In [25]:
df

      name class  English  Math
0    Alice     A        0   100
1      Bob     A       10    90
2  Charlie     B       20    80
3    David     B       30    70
4      Eve     A       40    60
5     Fred     C       50    50
6   George     A       60    40
7    Helen     B       70    30
8      Ian     C       80    20
9     John     C       90    10

In [4]:
df.groupby("class")

In [5]:
df.groupby("class").first()

          name  English  Math
class
A        Alice        0   100
B      Charlie       20    80
C         Fred       50    50

In [6]:
df.groupby("class").nth(0)

          name  English  Math
class
A        Alice        0   100
B      Charlie       20    80
C         Fred       50    50

In [7]:
df.groupby("class").head(1)

      name class  English  Math
0    Alice     A        0   100
2  Charlie     B       20    80
5     Fred     C       50    50

In [8]:
df.groupby("class").last()

         name  English  Math
class
A      George       60    40
B       Helen       70    30
C        John       90    10

In [9]:
df.groupby("class").nth(-1)

         name  English  Math
class
A      George       60    40
B       Helen       70    30
C        John       90    10

In [10]:
df.groupby("class").tail(1)

     name class  English  Math
6  George     A       60    40
7   Helen     B       70    30
9    John     C       90    10

## Nanがあるときどうなるの！？

In [56]:
df = pd.DataFrame({
    'name'    : ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Fred', 'George', 'Helen', 'Ian', 'John'],
    'class'   : ['A', 'A', 'B', 'B', 'A', 'C', 'A', 'B', 'C', 'C'],
    'English' : list(range(0, 100, 10)),
    'Math'    : list(range(100, 0, -10))    
})

In [57]:
import numpy as np
df.loc[0, "name"] = np.nan
df.loc[0, "English"] = np.nan
df.loc[0, "Math"] = np.nan
df.loc[1, "Math"] = np.nan
df.loc[5, "English"] = np.nan

In [58]:
df

      name class  English  Math
0      NaN     A      NaN   NaN
1      Bob     A     10.0   NaN
2  Charlie     B     20.0  80.0
3    David     B     30.0  70.0
4      Eve     A     40.0  60.0
5     Fred     C      NaN  50.0
6   George     A     60.0  40.0
7    Helen     B     70.0  30.0
8      Ian     C     80.0  20.0
9     John     C     90.0  10.0

In [59]:
df.groupby("class").first()

          name  English  Math
class
A          Bob     10.0  60.0
B      Charlie     20.0  80.0
C         Fred     80.0  50.0

In [60]:
df.groupby("class").head(1)

      name class  English  Math
0      NaN     A      NaN   NaN
2  Charlie     B     20.0  80.0
5     Fred     C      NaN  50.0

In [61]:
df.groupby("class").nth(0)

          name  English  Math
class
A          NaN      NaN   NaN
B      Charlie     20.0  80.0
C         Fred      NaN  50.0

In [62]:
df.groupby("class").nth(0, dropna="all")

          name  English  Math
class
A          NaN      NaN   NaN
B      Charlie     20.0  80.0
C         Fred      NaN  50.0

In [63]:
df.groupby("class").nth(0, dropna="any")

          name  English  Math
class
A          Eve     40.0  60.0
B      Charlie     20.0  80.0
C          Ian     80.0  20.0